In [1]:
import numpy as np
import pandas as pd

scores = np.random.randint(50, 101, (5, 3))
names = ('关羽', '张飞', '赵云', '马超', '黄忠')
courses = ('语文', '数学', '英语')
df = pd.DataFrame(data=scores, columns=courses, index=names)
df.mean(axis=1)

关羽    84.666667
张飞    83.000000
赵云    71.333333
马超    69.666667
黄忠    75.333333
dtype: float64

In [2]:
df.var()

语文    152.7
数学    207.8
英语    334.2
dtype: float64

In [3]:
df.describe()

              语文        数学         英语
count   5.000000   5.00000   5.000000
mean   78.800000  68.40000  83.200000
std    12.357184  14.41527  18.281138
min    65.000000  51.00000  53.000000
25%    69.000000  57.00000  79.000000
50%    80.000000  73.00000  92.000000
75%    84.000000  74.00000  95.000000
max    96.000000  87.00000  97.000000

In [ ]:
df.sort_values(by='语文', ascending=False)

    语文  数学  英语
张飞  96  74  79
关羽  84  73  97
黄忠  80  51  95
马超  69  87  53
赵云  65  57  92

In [6]:
df.nlargest(3, '语文')
df.nsmallest(3, '语文')

    语文  数学  英语
赵云  65  57  92
马超  69  87  53
黄忠  80  51  95

In [ ]:
# 按照'销售区域'对数据进行分组，并计算每个区域的销售额平均值、销售数量最大值和最小值
df.groupby('销售区域')[['销售额', '销售数量']].agg({
    '销售额': 'mean', '销售数量': ['max', 'min']
})

In [ ]:
# 提取销售日期中的月份信息
df['月份'] = df['销售日期'].dt.month
# 创建一个透视表，按销售区域和月份汇总销售额，并计算总计
pd.pivot_table(
    df, index='销售区域', columns='月份',
    values='销售额', aggfunc='sum', fill_value=0, 
    margins=True, margins_name='总计'
)
# index 对应 groupby 的列，columns 对应 where的汇总，values 对应需要汇总的值， aggfunc 对应汇总函数，
# fill_value 对应缺失值填充，margins 对应是否显示汇总行，margins_name 对应汇总行的名称